In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('loan.csv')

In [3]:
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    object
 1   Gender             601 non-null    object
 2   Married            611 non-null    object
 3   Dependents         599 non-null    object
 4   Education          614 non-null    object
 5   Self_Employed      582 non-null    object
 6   ApplicantIncome    614 non-null    int64
 7   CoapplicantIncome  614 non-null    float64
 8   LoanAmount         592 non-null    float64
 9   Loan_Amount_Term   600 non-null    float64
 10  Credit_History     564 non-null    float64
 11  Property_Area      614 non-null    object
 12  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(8)
memory usage: 62.5+ KB

In [6]:
df['Gender'].value_counts()

Gender
Male      489
Female    112
Name: count, dtype: int64

In [7]:
df['Married'].value_counts()

Married
Yes    398
No     213
Name: count, dtype: int64

In [32]:
df.isnull().sum()

Loan_ID          0
Gender           0
Married          0
Dependents       0
Education        0
Self_Employed    0
Property_Area    0
Loan_Status      0
dtype: int64

To fill null in any particular columns

In [15]:
df['Gender'].fillna(df['Gender'].mode()[0],inplace = True)
df['Married'].fillna(df['Married'].mode()[0],inplace = True)

To fill all clumns which contains object datatype missing value

In [10]:
df.select_dtypes(include = "object").columns

Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'Property_Area', 'Loan_Status'],
      dtype='object')

To fill all object datatype columns at once

In [35]:
for i in df.select_dtypes(include = "object").columns:
    df[i].fillna(df[i].mode()[0])

Performing OneHotEncoder

In [45]:
en_data = df[["Self_Employed","Married"]]

In [46]:
en_data

    Self_Employed Married
0              No      No
1              No     Yes
2             Yes     Yes
3              No     Yes
4              No      No
..            ...     ...
609            No      No
610            No     Yes
611            No     Yes
612            No     Yes
613           Yes      No

[614 rows x 2 columns]

In [58]:
pd.get_dummies(en_data)

     Self_Employed_No  Self_Employed_Yes  Married_No  Married_Yes
0                True              False        True        False
1                True              False       False         True
2               False               True       False         True
3                True              False       False         True
4                True              False        True        False
..                ...                ...         ...          ...
609              True              False        True        False
610              True              False       False         True
611              True              False       False         True
612              True              False       False         True
613             False               True        True        False

[614 rows x 4 columns]

In [68]:
from sklearn.preprocessing import OneHotEncoder
ohe = OneHotEncoder()
ohe.fit_transform(en_data)

<614x4 sparse matrix of type '<class 'numpy.float64'>'
	with 1228 stored elements in Compressed Sparse Row format>

sparse matrix are those matrix where most of content are  filled with 0 and 1

In [69]:
# Need to convert these data into Array
ar = ohe.fit_transform(en_data).toarray()
ar

array([[1., 0., 1., 0.],
       [1., 0., 0., 1.],
       [0., 1., 0., 1.],
       ...,
       [1., 0., 0., 1.],
       [1., 0., 0., 1.],
       [0., 1., 1., 0.]])

In [70]:
# Need to convert this array in dataframe
ar = ohe.fit_transform(en_data).toarray()
pd.DataFrame(ar,columns=pd.get_dummies(en_data).columns)

     Self_Employed_No  Self_Employed_Yes  Married_No  Married_Yes
0                 1.0                0.0         1.0          0.0
1                 1.0                0.0         0.0          1.0
2                 0.0                1.0         0.0          1.0
3                 1.0                0.0         0.0          1.0
4                 1.0                0.0         1.0          0.0
..                ...                ...         ...          ...
609               1.0                0.0         1.0          0.0
610               1.0                0.0         0.0          1.0
611               1.0                0.0         0.0          1.0
612               1.0                0.0         0.0          1.0
613               0.0                1.0         1.0          0.0

[614 rows x 4 columns]

Droping First Column

In [75]:
from sklearn.preprocessing import OneHotEncoder
ohe = OneHotEncoder(drop = "first")
ohe.fit_transform(en_data)

<614x2 sparse matrix of type '<class 'numpy.float64'>'
	with 483 stored elements in Compressed Sparse Row format>

In [76]:
ar = ohe.fit_transform(en_data).toarray()
ar

array([[0., 0.],
       [0., 1.],
       [1., 1.],
       ...,
       [0., 1.],
       [0., 1.],
       [1., 0.]])

In [77]:
pd.DataFrame(ar,columns=['Self_Employed_Yes','Married_Yes'])

     Self_Employed_Yes  Married_Yes
0                  0.0          0.0
1                  0.0          1.0
2                  1.0          1.0
3                  0.0          1.0
4                  0.0          0.0
..                 ...          ...
609                0.0          0.0
610                0.0          1.0
611                0.0          1.0
612                0.0          1.0
613                1.0          0.0

[614 rows x 2 columns]